{
    "investing": [
        "I pray for the health of all Tesla share and option holders. The last 15mins of trading today was insane. Tesla traded like a penny stock.",
        "Imagine crying on 30% profits because the said rare gem went up gadzillion more % afterwards.",
        "No you did not do wrong by taking profits on risky, barely standing near bankrupt asset. If you have your hands dirty with those kind of assets that early, you would know that 9/10 times they go down hard and take all your money with them.",
        "People told me about 50 times this year that they found the next Amazon, yet all they found in longer term is just another 80% loser. And no, one Tesla gains wouldn't make back the loses of thousands of ''this is the next Tesla/Amazon''",
        "Tesla is the craziest stock. Hindsight is easy to look at but I still regret not buying this shit at $25/share.",
        "He said *most profitable*. Tesla definitely doesn't qualify.",
        "How do you think stock prices of Tesla will react on Monday?"
    ],
    "personalfinance": [
        "My first mortgage was $716 per month, inclusive of PITI, so I completely agree.  ",
        "$700/month on a car is basically a Tesla (the upgraded one)",
        "Yeah. 15 percent ESPP. You must really have a lot of faith in that company. Unless you work for apple or Tesla. I don’t see why anyone would put that much in",
        "My husband's uncle wanted to buy a Tesla with cash and they said no.  He's from a different country and doesn't really trust banks so he keeps a lot of money in cash.",
        "Generally a bad is too carry two different insurances. Other than the problem in if there's an issue magically both of them feel it is the others fault, you're probably spending extra money. Each insurance company would act very weird with this knowledge. Think of the complications with members of household etc. Just choose the cheaper combined. Also if you can afford a Tesla you may want to have umbrella insurance too. So you may want to look at which provider is the best after you think about combining other insurances you need.",
        "Depends what you mean by \"low risk investment.\" If you mean a diversified bond fund, then I'd consider it to maybe get a little higher returns than an HYSA with relatively little downside risk. If, on the other hand, you consider Tesla stock a low risk investment because Elon Musk can do no wrong, then not a chance."
    ],
    "cryptocurrency": [
        "My crypto moons, my Tesla stock moons. This is the best year of my life.",
        "Prove me wrong, lots of room for price growth and Im tryng to buy a tesla haha",
        "There's already been a period of people in loss, always has been, always will be. Especially with new tokens.",
        "You know when you buy a stock early and you wonder \"How could anyone have lost money on this?\" When its at the top? Plenty of people have lost money at the top. That's how fomo works.",
        "People have lost money on tesla, on bitcoin, and anything else thats currently hitting ath, including a day old token."
    ],
    "securityanalysis": [
        "But Tesla has been doing well to give the impression they are years ahead and Toyota has been giving the impression it is years behind. I for one, will be happy if Tesla does not dominate the EV space.",
        "I’m assuming Xpeng will require their cars to be online like Tesla. Is that a national security risk?",
        "Totally agree. While I am fine with Tesla being a leader in the space, legitimate competition from the large car manufacturers (like Toyota) is needed to keep pushing the technology forward and to keep prices in check. I do think the Chinese EV companies are a bit of a double edged sword though, good for the consumer with the price points, but bad for the industry by ultimately stealing EV/battery technology without any of their own R&amp;D. They can  undercut legitimate manufacturers since they don’t have to make up those costs.",
        "Here's a good read on the current state of development of solid-state batteries, which is what Toyota is using: https://electrek.co/2020/12/08/tesla-co-founder-jb-straubel-quantumscape-new-fast-charging-battery-major-breakthrough/",
        "QS plans to have 20Gwh of battery production in 2027. It's basically a drop in the ocean half a decade away and the planned density pretty much match what Tesla is expected to release with their 4680 cells in 2021-2022."
    ],
    "finance": [
        "Jesus..whether or not you guys agree with the valuation, comments like this show that none of you guys even know what the company does. It’s data warehousing and outsmarted it’s competitors (mainly  Amazon now)  by separating storage and compute and charging for each separately which has led many companies to switch to this extremely flexible platform and move a lot of data over. Once you get clients on, they aren’t going to leave due to the intrinsically sticky nature of data warehousing. The company is led by Frank Slootman, who is an absolute legend of a CEO in the valley. This guy doesn’t get 100mm a month in stock options for nothing. Yes, the company is probably overvalued(maybe significantly)  as most tech names are right now, but that doesn’t mean it’s some dot com bubble garbage co. It’s still an extremely string product that obviously their market is receptive to (158% net dollar retention, revenue growing at 120%+ YoY at scale). People on this sub claim every richly valued tech company is some trash ass company that is worth 0. The fact is growth right now in tech is valued over all and investors are willing to pay absurd premiums for these growth companies. Some are reasonable IMO (such as snowflake and these cloud companies that have TAMs bigger than most really price in/know and some are like Tesla which IMO are more absurd than a enterprise software company with much more favorable economics)",
        "Just wow. Because people lost money by not doing there due diligence, now they are upset and sue. There are thousands of tutorials online about how to trade options and how markets work. The whole thing is a game.",
        "Those seem much more important than what’s going on on r/wallstreetbets and Tesla/Apple calls.",
        "Crazy how investors reward Tesla +4% for it's listing on S&amp;P and I know their is some demand due to there institutional  funds have to buy , but I believe sold the news on PFE and BNTX down 5% and 15% respectively, shipping the most important item the world can't do without.  Either way the market has spoken.",
        "Cited article by Arnott et al.: [Tesla, the Largest-Cap Stock Ever to Enter S&amp;P 500: A Buy Signal or a Bubble?](https://www.researchaffiliates.com/en_us/publications/articles/819-tesla-the-largest-cap-stock-ever.html)"
    ]
}
